app/controllers/sandwiches_controller.rb

SELECT "sandwiches".* FROM "sandwiches"
---
	def index
	  sandwiches = Sandwich.all

SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT 1  [["id", 1]]
---
	def add_ingredient
	  sandwich = Sandwich.find_by(id: params[:id])
	  unless sandwich
	    render json: {error: "sandwich not found"},
	    status: 404
	    return
	  end
	  ingredient = Ingredient.find_by(id: params[:ingredient_id])